bekencorp/armino/middleware/soc/bk7256_cp1/soc/sys_struct.h
// Copyright 2020-2021 Beken 
// 
// Licensed under the Apache License, Version 2.0 (the "License");           
// you may not use this file except in compliance with the License.            
// You may obtain a copy of the License at                                     
//                                                                             
//     http://www.apache.org/licenses/LICENSE-2.0                              
//                                                                             
// Unless required by applicable law or agreed to in writing, software         
// distributed under the License is distributed on an "AS IS" BASIS,         
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.    
// See the License for the specific language governing permissions and         
// limitations under the License.                                              

/***********************************************************************************************************************************
* This file is generated from BK7256_ADDR Mapping_20211224_format_change_highlight_20220113_update.xlsm automatically                                
* Modify it manually is not recommended                                       
* CHIP ID:BK7256,GENARATE TIME:2022-03-17 20:29:38                                                 
************************************************************************************************************************************/

#pragma once                 
                            
#ifdef __cplusplus          
extern "C" {              
#endif                      

typedef volatile struct {

    /* REG_0x00 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  deviceid                       :32;  //0x0[31:0], ,0x53434647,RO
        }; 
        uint32_t v; 
    }device_id; 

    /* REG_0x01 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  versionid                      :32;  //0x1[31:0], ,0x72560001,RO
        }; 
        uint32_t v; 
    }version_id; 

    /* REG_0x02 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  core0_halted                   : 1;  //0x2[0],core0 halt indicate,0,RO
           volatile uint32_t  core1_halted                   : 1;  //0x2[1],core1 halt indicate,0,RO
           volatile uint32_t  reserved0                      : 2;  //0x2[3:2],NC,0,R
           volatile uint32_t  cpu0_sw_reset                  : 1;  //0x2[4],cpu0_sw_reset indicate,0,RO
           volatile uint32_t  cpu1_sw_reset                  : 1;  //0x2[5],cpu1_sw_reset indicate,0,RO
           volatile uint32_t  reserved1                      : 2;  //0x2[7:6],NC,0,R
           volatile uint32_t  cpu0_pwr_dw_state              : 1;  //0x2[8],cpu0_pwr_dw_state,0,RO
           volatile uint32_t  cpu1_pwr_dw_state              : 1;  //0x2[9],cpu1_pwr_dw_state,0,RO
           volatile uint32_t  reserved2                      :22;  //0x2[31:10],NC,0,R
        }; 
        uint32_t v; 
    }cpu_current_run_status; 

    /* REG_0x03 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  boot_mode                      : 1;  //0x3[0],0:ROM boot 1:FLASH boot,0,R/W
           volatile uint32_t  reserved0                      : 7;  //0x3[7:1],NC,0,R
           volatile uint32_t  jtag_core_sel                  : 1;  //0x3[8],0:jtag connect core0, 1:jtag connect core1,0,R/W
           volatile uint32_t  flash_sel                      : 1;  //0x3[9],0: normal flash operation 1:flash download by spi,0,R/W
           volatile uint32_t  reserved1                      :22;  //0x3[31:10],NC,0,R
        }; 
        uint32_t v; 
    }cpu_storage_connect_op_select; 

    /* REG_0x04 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  cpu0_sw_rst                    : 1;  //0x4[0],reserved,0,R/W
           volatile uint32_t  cpu0_pwr_dw                    : 1;  //0x4[1],reserved,0,R/W
           volatile uint32_t  cpu0_int_mask                  : 1;  //0x4[2],cpu0 int mask,0,R/W
           volatile uint32_t  cpu0_halt                      : 1;  //0x4[3],core0 halt indicate,0,R/W
           volatile uint32_t  cpu0_clk_div                   : 4;  //0x4[7:4],Frequency division : F/(1+N), N is the data of the reg value,0,R/W
           volatile uint32_t  cpu0_offset                    :24;  //0x4[31:8],reserved,0x0,RO
        }; 
        uint32_t v; 
    }cpu0_int_halt_clk_op; 

    /* REG_0x05 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  cpu1_sw_rst                    : 1;  //0x5[0],reserved,0,R/W
           volatile uint32_t  cpu1_pwr_dw                    : 1;  //0x5[1],reserved,0,R/W
           volatile uint32_t  cpu1_int_mask                  : 1;  //0x5[2],cpu1 int mask,0,R/W
           volatile uint32_t  cpu1_halt                      : 1;  //0x5[3],core1 halt indicate,0,R/W
           volatile uint32_t  cpu1_clk_div                   : 4;  //0x5[7:4],Frequency division : F/(1+N), N is the data of the reg value,0,R/W
           volatile uint32_t  cpu1_offset                    :24;  //0x5[31:8],reserved,0x0,R/W
        }; 
        uint32_t v; 
    }cpu1_int_halt_clk_op; 

    /* REG_0x06 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  reserved                       :32;  //0x6[31:0] , ,None,None
        }; 
        uint32_t v; 
    }reserved_reg0x6; 

    /* REG_0x07 */
    union 
    { 
        struct 
        { 
           volatile uint32_t reserved:32;  
        }; 
        uint32_t v; 
    }reg_0x7_reserved; 

    /* REG_0x08 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  clkdiv_core                    : 4;  //0x8[3:0],Frequency division : F/(1+N), N is the data of the reg value,0,R/W
           volatile uint32_t  cksel_core                     : 2;  //0x8[5:4],0:XTAL       1 : clk_DCO      2 : 320M      3 : 480M,0,R/W
           volatile uint32_t  clkdiv_bus                     : 1;  //0x8[6],Frequency division : F/(1+N), N is the data of the reg value,0,R/W
           volatile uint32_t  reserved0                      : 1;  //0x8[7],NC,0,R
           volatile uint32_t  clkdiv_uart0                   : 2;  //0x8[9:8],Frequency division :    0:/1  1:/2  2:/4  3:/8,0,R/W
           volatile uint32_t  clksel_uart0                   : 1;  //0x8[10],0:XTAL              1:APLL,0,R/W
           volatile uint32_t  clkdiv_uart1                   : 2;  //0x8[12:11],Frequency division :    0:/1  1:/2  2:/4  3:/8,0,R/W
           volatile uint32_t  cksel_uart1                    : 1;  //0x8[13],0:XTAL              1:APLL,0,R/W
           volatile uint32_t  clkdiv_uart2                   : 2;  //0x8[15:14],Frequency division :    0:/1  1:/2  2:/4  3:/8,0,R/W
           volatile uint32_t  cksel_uart2                    : 1;  //0x8[16],0:XTAL              1:APLL,0,R/W
           volatile uint32_t  cksel_sadc                     : 1;  //0x8[17],0:XTAL              1:APLL,0,R/W
           volatile uint32_t  cksel_pwm0                     : 1;  //0x8[18],0:clk32              1:XTAL,0,R/W
           volatile uint32_t  cksel_pwm1                     : 1;  //0x8[19],0:clk32              1:XTAL,0,R/W
           volatile uint32_t  cksel_timer0                   : 1;  //0x8[20],0:clk32              1:XTAL,0,R/W
           volatile uint32_t  cksel_timer1                   : 1;  //0x8[21],0:clk32              1:XTAL,0,R/W
           volatile uint32_t  cksel_timer2                   : 1;  //0x8[22],0:clk32              1:XTAL,0,R/W
           volatile uint32_t  reserved1                      : 1;  //0x8[23],NC,0,R
           volatile uint32_t  cksel_i2s                      : 1;  //0x8[24],0:XTAL              1:APLL,0,R/W
           volatile uint32_t  cksel_aud                      : 1;  //0x8[25],0:XTAL              1:APLL,0,R/W
           volatile uint32_t  clkdiv_jpeg                    : 4;  //0x8[29:26],Frequency division : F/(1+N), N is the data of the reg value,0,R/W
           volatile uint32_t  cksel_jpeg                     : 1;  //0x8[30],0:clk_320M      1:clk_480M,0,R/W
           volatile uint32_t  clkdiv_disp_l                  : 1;  //0x8[31],Frequency division : F/(1+clkdiv_disp_l+clkdiv_disp_h*2),0,R/W
        }; 
        uint32_t v; 
    }cpu_clk_div_mode1; 

    /* REG_0x09 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  clkdiv_disp_h                  : 3;  //0x9[2:0],Frequency division : F/(1+clkdiv_disp_l+clkdiv_disp_h*2),0,R/W
           volatile uint32_t  cksel_disp                     : 1;  //0x9[3],0:clk_320M      1:clk_480M,0,R/W
           volatile uint32_t  ckdiv_psram                    : 1;  //0x9[4],Frequency division : F/(1+N), N is the data of the reg value,0,R/W
           volatile uint32_t  cksel_psram                    : 1;  //0x9[5],0:clk_320M      1:clk_480M,0,R/W
           volatile uint32_t  ckdiv_qspi0                    : 4;  //0x9[9:6],Frequency division : F/(1+N), N is the data of the reg value,0,R/W
           volatile uint32_t  reserved0                      : 4;  //0x9[13:10], ,None,None
           volatile uint32_t  ckdiv_sdio                     : 3;  //0x9[16:14],0:/1  1:/2  2:/4  3:/8  4:/16  5:/32  6:/64  7:/256,0,R/W
           volatile uint32_t  cksel_sdio                     : 1;  //0x9[17],0：XTAL          1：320M,0,R/W
           volatile uint32_t  ckdiv_auxs                     : 4;  //0x9[21:18],Frequency division : F/(1+N), N is the data of the reg value,0,R/W
           volatile uint32_t  cksel_auxs                     : 2;  //0x9[23:22],0:DCO              1:APLL                2:320M                     4:480M,0,R/W
           volatile uint32_t  cksel_flash                    : 2;  //0x9[25:24],0:XTAL              1:APLL               1x :clk_120M,0,R/W
           volatile uint32_t  ckdiv_flash                    : 2;  //0x9[27:26],0:/1  1:/2  2:/4  3:/8,0,R/W
           volatile uint32_t  ckdiv_i2s0                     : 3;  //0x9[30:28],0:/1  1:/2  2:/4  3:/8  4:/16  5:/32  6:/64  7:/256,0,R/W
           volatile uint32_t  reserved1                      : 1;  //0x9[31],NC,0,R
        }; 
        uint32_t v; 
    }cpu_clk_div_mode2; 

