bekencorp/armino/middleware/soc/bk7256_cp1/soc/sys_struct.h
    /* REG_0x12 */
    union 
    { 
        struct 
        { 
           volatile uint32_t reserved:32;  
        }; 
        uint32_t v; 
    }reg_0x12_reserved; 

    /* REG_0x13 */
    union 
    { 
        struct 
        { 
           volatile uint32_t reserved:32;  
        }; 
        uint32_t v; 
    }reg_0x13_reserved; 

    /* REG_0x14 */
    union 
    { 
        struct 
        { 
           volatile uint32_t reserved:32;  
        }; 
        uint32_t v; 
    }reg_0x14_reserved; 

    /* REG_0x15 */
    union 
    { 
        struct 
        { 
           volatile uint32_t reserved:32;  
        }; 
        uint32_t v; 
    }reg_0x15_reserved; 

    /* REG_0x16 */
    union 
    { 
        struct 
        { 
           volatile uint32_t reserved:32;  
        }; 
        uint32_t v; 
    }reg_0x16_reserved; 

    /* REG_0x17 */
    union 
    { 
        struct 
        { 
           volatile uint32_t reserved:32;  
        }; 
        uint32_t v; 
    }reg_0x17_reserved; 

    /* REG_0x18 */
    union 
    { 
        struct 
        { 
           volatile uint32_t reserved:32;  
        }; 
        uint32_t v; 
    }reg_0x18_reserved; 

    /* REG_0x19 */
    union 
    { 
        struct 
        { 
           volatile uint32_t reserved:32;  
        }; 
        uint32_t v; 
    }reg_0x19_reserved; 

    /* REG_0x1a */
    union 
    { 
        struct 
        { 
           volatile uint32_t reserved:32;  
        }; 
        uint32_t v; 
    }reg_0x1a_reserved; 

    /* REG_0x1b */
    union 
    { 
        struct 
        { 
           volatile uint32_t reserved:32;  
        }; 
        uint32_t v; 
    }reg_0x1b_reserved; 

    /* REG_0x1c */
    union 
    { 
        struct 
        { 
           volatile uint32_t reserved:32;  
        }; 
        uint32_t v; 
    }reg_0x1c_reserved; 

    /* REG_0x1d */
    union 
    { 
        struct 
        { 
           volatile uint32_t reserved:32;  
        }; 
        uint32_t v; 
    }reg_0x1d_reserved; 

    /* REG_0x1e */
    union 
    { 
        struct 
        { 
           volatile uint32_t reserved:32;  
        }; 
        uint32_t v; 
    }reg_0x1e_reserved; 

    /* REG_0x1f */
    union 
    { 
        struct 
        { 
           volatile uint32_t reserved:32;  
        }; 
        uint32_t v; 
    }reg_0x1f_reserved; 

    /* REG_0x20 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  cpu0_bmc32_int_en              : 1;  //0x20[0], ,0,R/W
           volatile uint32_t  cpu0_host_0_irq_en             : 1;  //0x20[1], ,0,R/W
           volatile uint32_t  cpu0_host_0_sec_irq_en         : 1;  //0x20[2], ,0,R/W
           volatile uint32_t  cpu0_timer_int_en              : 1;  //0x20[3], ,0,R/W
           volatile uint32_t  cpu0_uart_int_en               : 1;  //0x20[4], ,0,R/W
           volatile uint32_t  cpu0_pwm_int_en                : 1;  //0x20[5], ,0,R/W
           volatile uint32_t  cpu0_i2c_int_en                : 1;  //0x20[6], ,0,R/W
           volatile uint32_t  cpu0_spi_int_en                : 1;  //0x20[7], ,0,R/W
           volatile uint32_t  cpu0_sadc_int_en               : 1;  //0x20[8], ,0,R/W
           volatile uint32_t  cpu0_irda_int_en               : 1;  //0x20[9], ,0,R/W
           volatile uint32_t  cpu0_sdio_int_en               : 1;  //0x20[10], ,0,R/W
           volatile uint32_t  cpu0_gdma_int_en               : 1;  //0x20[11], ,0,R/W
           volatile uint32_t  cpu0_la_int_en                 : 1;  //0x20[12], ,0,R/W
           volatile uint32_t  cpu0_timer1_int_en             : 1;  //0x20[13], ,0,R/W
           volatile uint32_t  cpu0_i2c1_int_en               : 1;  //0x20[14], ,0,R/W
           volatile uint32_t  cpu0_uart1_int_en              : 1;  //0x20[15], ,0,R/W
           volatile uint32_t  cpu0_uart2_int_en              : 1;  //0x20[16], ,0,R/W
           volatile uint32_t  cpu0_spi1_int_en               : 1;  //0x20[17], ,0,R/W
           volatile uint32_t  cpu0_can_int_en                : 1;  //0x20[18], ,0,R/W
           volatile uint32_t  cpu0_usb_int_en                : 1;  //0x20[19], ,0,R/W
           volatile uint32_t  cpu0_qspi_int_en               : 1;  //0x20[20], ,0,R/W
           volatile uint32_t  cpu0_fft_int_en                : 1;  //0x20[21], ,0,R/W
           volatile uint32_t  cpu0_sbc_int_en                : 1;  //0x20[22], ,0,R/W
           volatile uint32_t  cpu0_aud_int_en                : 1;  //0x20[23], ,0,R/W
           volatile uint32_t  cpu0_i2s_int_en                : 1;  //0x20[24], ,0,R/W
           volatile uint32_t  cpu0_jpegenc_int_en            : 1;  //0x20[25], ,0,R/W
           volatile uint32_t  cpu0_jpegdec_int_en            : 1;  //0x20[26], ,0,R/W
           volatile uint32_t  cpu0_lcd_int_en                : 1;  //0x20[27], ,0,R/W
           volatile uint32_t  cpu0_dma2d_int_en              : 1;  //0x20[28], ,0,R/W
           volatile uint32_t  cpu0_wifi_int_phy_mpb_en       : 1;  //0x20[29], ,0,R/W
           volatile uint32_t  cpu0_wifi_int_phy_riu_en       : 1;  //0x20[30], ,0,R/W
           volatile uint32_t  cpu0_wifi_mac_int_tx_rx_timer_en : 1;  //0x20[31], ,0,R/W
        }; 
        uint32_t v; 
    }cpu0_int_0_31_en; 

    /* REG_0x21 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  cpu0_wifi_mac_int_tx_rx_misc_en : 1;  //0x21[0], ,0,R/W
           volatile uint32_t  cpu0_wifi_mac_int_rx_trigger_en : 1;  //0x21[1], ,0,R/W
           volatile uint32_t  cpu0_wifi_mac_int_tx_trigger_en : 1;  //0x21[2], ,0,R/W
           volatile uint32_t  cpu0_wifi_mac_int_prot_trigger_en : 1;  //0x21[3], ,0,R/W
           volatile uint32_t  cpu0_wifi_mac_int_gen_en       : 1;  //0x21[4], ,0,R/W
           volatile uint32_t  cpu0_wifi_hsu_irq_en           : 1;  //0x21[5], ,0,R/W
           volatile uint32_t  cpu0_wifi_int_mac_wakeup_en    : 1;  //0x21[6], ,0,R/W
           volatile uint32_t  cpu0_dm_irq_en                 : 1;  //0x21[7], ,0,R/W
           volatile uint32_t  cpu0_ble_irq_en                : 1;  //0x21[8], ,0,R/W
           volatile uint32_t  cpu0_bt_irq_en                 : 1;  //0x21[9], ,0,R/W
           volatile uint32_t  reserved2                      : 6;  //0x21[15:10], ,0,R/W
           volatile uint32_t  cpu0_mbox0_int_en              : 1;  //0x21[16], ,0,R/W
           volatile uint32_t  cpu0_mbox1_int_en              : 1;  //0x21[17], ,0,R/W
           volatile uint32_t  cpu0_bmc64_int_en              : 1;  //0x21[18], ,0,R/W
           volatile uint32_t  reserved3                      : 1;  //0x21[19], ,0,R/W
           volatile uint32_t  cpu0_touched_int_en            : 1;  //0x21[20], ,0,R/W
           volatile uint32_t  cpu0_usbplug_int_en            : 1;  //0x21[21], ,0,R/W
           volatile uint32_t  cpu0_rtc_int_en                : 1;  //0x21[22], ,0,R/W
           volatile uint32_t  cpu0_gpio_int_en               : 1;  //0x21[23], ,0,R/W
           volatile uint32_t  reserved4                      : 8;  //0x21[31:24], ,0,R/W
        }; 
        uint32_t v; 
    }cpu0_int_32_63_en; 

