bekencorp/armino/middleware/soc/bk7256_cp1/soc/sys_struct.h
    /* REG_0x32 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  sys_gpio16                     : 4;  //0x32[3:0],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
           volatile uint32_t  sys_gpio17                     : 4;  //0x32[7:4],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
           volatile uint32_t  sys_gpio18                     : 4;  //0x32[11:8],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
           volatile uint32_t  sys_gpio19                     : 4;  //0x32[15:12],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
           volatile uint32_t  sys_gpio20                     : 4;  //0x32[19:16],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
           volatile uint32_t  sys_gpio21                     : 4;  //0x32[23:20],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
           volatile uint32_t  sys_gpio22                     : 4;  //0x32[27:24],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
           volatile uint32_t  sys_gpio23                     : 4;  //0x32[31:28],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
        }; 
        uint32_t v; 
    }gpio_config2; 

    /* REG_0x33 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  sys_gpio24                     : 4;  //0x33[3:0],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
           volatile uint32_t  sys_gpio25                     : 4;  //0x33[7:4],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
           volatile uint32_t  sys_gpio26                     : 4;  //0x33[11:8],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
           volatile uint32_t  sys_gpio27                     : 4;  //0x33[15:12],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
           volatile uint32_t  sys_gpio28                     : 4;  //0x33[19:16],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
           volatile uint32_t  sys_gpio29                     : 4;  //0x33[23:20],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
           volatile uint32_t  sys_gpio30                     : 4;  //0x33[27:24],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
           volatile uint32_t  sys_gpio31                     : 4;  //0x33[31:28],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
        }; 
        uint32_t v; 
    }gpio_config3; 

    /* REG_0x34 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  sys_gpio32                     : 4;  //0x34[3:0],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
           volatile uint32_t  sys_gpio33                     : 4;  //0x34[7:4],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
           volatile uint32_t  sys_gpio34                     : 4;  //0x34[11:8],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
           volatile uint32_t  sys_gpio35                     : 4;  //0x34[15:12],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
           volatile uint32_t  sys_gpio36                     : 4;  //0x34[19:16],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
           volatile uint32_t  sys_gpio37                     : 4;  //0x34[23:20],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
           volatile uint32_t  sys_gpio38                     : 4;  //0x34[27:24],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
           volatile uint32_t  sys_gpio39                     : 4;  //0x34[31:28],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
        }; 
        uint32_t v; 
    }gpio_config4; 

    /* REG_0x35 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  sys_gpio40                     : 4;  //0x35[3:0],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
           volatile uint32_t  sys_gpio41                     : 4;  //0x35[7:4],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
           volatile uint32_t  sys_gpio42                     : 4;  //0x35[11:8],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
           volatile uint32_t  sys_gpio43                     : 4;  //0x35[15:12],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
           volatile uint32_t  sys_gpio44                     : 4;  //0x35[19:16],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
           volatile uint32_t  sys_gpio45                     : 4;  //0x35[23:20],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
           volatile uint32_t  sys_gpio46                     : 4;  //0x35[27:24],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
           volatile uint32_t  sys_gpio47                     : 4;  //0x35[31:28],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
        }; 
        uint32_t v; 
    }gpio_config5; 

    /* REG_0x36 */
    union 
    { 
        struct 
        { 
           volatile uint32_t reserved:32;  
        }; 
        uint32_t v; 
    }reg_0x36_reserved; 

    /* REG_0x37 */
    union 
    { 
        struct 
        { 
           volatile uint32_t reserved:32;  
        }; 
        uint32_t v; 
    }reg_0x37_reserved; 

    /* REG_0x38 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  dbug_config0                   :32;  //0x38[31:0], ,0,R/W
        }; 
        uint32_t v; 
    }sys_debug_config0; 

    /* REG_0x39 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  dbug_config1                   :32;  //0x39[31:0],0: btsp_debug[0:32]        1: btsp_debug[32+:32]           2: btsp_debug[64+:32]  4:btsp_debug[96+:6]       5:wifip_mac_dbg[31:0]           6: wifip_phy_dbg[31:0]                            default:  dbug_config0                   ,0,R/W
        }; 
        uint32_t v; 
    }sys_debug_config1; 

    /* REG_0x3a */
    union 
    { 
        struct 
        { 
           volatile uint32_t reserved:32;  
        }; 
        uint32_t v; 
    }reg_0x3a_reserved; 

    /* REG_0x3b */
    union 
    { 
        struct 
        { 
           volatile uint32_t reserved:32;  
        }; 
        uint32_t v; 
    }reg_0x3b_reserved; 

    /* REG_0x3c */
    union 
    { 
        struct 
        { 
           volatile uint32_t reserved:32;  
        }; 
        uint32_t v; 
    }reg_0x3c_reserved; 

    /* REG_0x3d */
    union 
    { 
        struct 
        { 
           volatile uint32_t reserved:32;  
        }; 
        uint32_t v; 
    }reg_0x3d_reserved; 

    /* REG_0x3e */
    union 
    { 
        struct 
        { 
           volatile uint32_t reserved:32;  
        }; 
        uint32_t v; 
    }reg_0x3e_reserved; 

    /* REG_0x3f */
    union 
    { 
        struct 
        { 
           volatile uint32_t reserved:32;  
        }; 
        uint32_t v; 
    }reg_0x3f_reserved; 

    /* REG_0x40 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  ck2652sel                      : 1;  //0x40[0],1:26MHz/0:52MHz,0,R/W
           volatile uint32_t  cp                             : 3;  //0x40[3:1],cp curent control 0to 350uA 50uA step,2,R/W
           volatile uint32_t  spideten                       : 1;  //0x40[4],unlock detect enable fron spi 1:enable,1,R/W
           volatile uint32_t  hvref                          : 2;  //0x40[6:5],high vth control for unlock detect 00:0.85V;01:0.9V;10:0.95V;11:1.05V,2,R/W
           volatile uint32_t  lvref                          : 2;  //0x40[8:7],low vth control for unlock detect 00:0.2V;01:0.3V;10:0.35V;11:0.4V,2,R/W
           volatile uint32_t  rzctrl26m                      : 1;  //0x40[9],Rz ctrl in 26M mode:1:normal;0:add 14K,0,R/W
           volatile uint32_t  looprzctrl                     : 4;  //0x40[13:10],Rz ctrl:2K to 17K,1K step,9,R/W
           volatile uint32_t  rpc                            : 2;  //0x40[15:14],second pole Rp ctrl:00:30K;01:10K;10:22K;11:2K,2,R/W
           volatile uint32_t  nsyn                           : 1;  //0x40[16],N divider rst,1,R/W
           volatile uint32_t  cksel                          : 2;  //0x40[18:17],0:26M;1:40M;2:24M;3:19.2M,0,R/W
           volatile uint32_t  spitrig                        : 1;  //0x40[19],SPI band selection trigger signal,0,R/W
           volatile uint32_t  band                           : 5;  //0x40[24:20],band manual value/band[0] ,0,R/W
           volatile uint32_t  bandmanual                     : 1;  //0x40[25],1:band manual;0:band auto,0,R/W
           volatile uint32_t  dsptrig                        : 1;  //0x40[26],band selection trigger signal,0,R/W
           volatile uint32_t  lpen_dpll                      : 1;  //0x40[27],dpll low power mode enable,0,R/W
           volatile uint32_t  xamp                           : 4;  //0x40[31:28],xtal OSC amp control/xamp<0> shared with pll_cktst_en,0xF,R/W
        }; 
        uint32_t v; 
    }ana_reg0; 

    /* REG_0x41 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  nc                             : 1;  //0x41[0],NC,0,R/W
           volatile uint32_t  dpll_vrefsel                   : 1;  //0x41[1],dpll ldo reference voltage selection  0:vbg_aon/1:vbg_cal,0,R/W
           volatile uint32_t  msw                            : 9;  //0x41[10:2],set the frequency of DCO manual,70,R/W
           volatile uint32_t  ictrl                          : 3;  //0x41[13:11],controlling the bias cuttent of DCO core,1,R/W
           volatile uint32_t  osc_trig                       : 1;  //0x41[14],reset the DCO core by spi to make it oscillate again,0,R/W
           volatile uint32_t  osccal_trig                    : 1;  //0x41[15],trigger the action of callibration in the DCO,0,R/W
           volatile uint32_t  cnti                           : 9;  //0x41[24:16],set the controlling work of calibration in the DCO block to get the different frequency,C0,R/W
           volatile uint32_t  spi_rst                        : 1;  //0x41[25],reset the calibration block of DCO by spi,0,R/W
           volatile uint32_t  amsel                          : 1;  //0x41[26],disable the calibration function of the DCO,set the frequency of DCO manual,1,R/W
           volatile uint32_t  divctrl                        : 3;  //0x41[29:27],controlling the value of divider in the DCO to get the different frequency,7,R/W
           volatile uint32_t  dco_tsten                      : 1;  //0x41[30],dco test enable,0,R/W
           volatile uint32_t  rosc_tsten                     : 1;  //0x41[31],rosc test enable,0,R/W
        }; 
        uint32_t v; 
    }ana_reg1; 

